In [2]:
import numpy as np
import pandas as pd

In [3]:
dict1={
    "name":['prince','satyam','avinash'],
    "marks":[92,85,77],
    "city":['rampur','kolkata','kanpur']
}

In [4]:
df=pd.DataFrame(dict1)

In [5]:
df

      name  marks     city
0   prince     92   rampur
1   satyam     85  kolkata
2  avinash     77   kanpur

In [7]:
df.to_csv('friends.csv')

In [8]:
df.to_csv('friends_index_false.csv',index=False)

In [10]:
df.describe()

           marks
count   3.000000
mean   84.666667
std     7.505553
min    77.000000
25%    81.000000
50%    85.000000
75%    88.500000
max    92.000000